### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bastion.azurerm_public_ip.this has changed
  ~ resource "azurerm_public_ip" "this" {
        id                      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-bastion-dev-rg/providers/Microsoft.Network/publicIPAddresses/rsi-bastion-pip"
      + ip_tags                 = {}
        name                    = "rsi-bastion-pip"
        tags                    = {
            "Component"   = "Access"
            "Region"      = "uk south"
            "Terraform"   = "true"
            "environment" = "dev"
        }
      + zones                   = []
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.azurerm_bastion_host.this will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "uksouth"
      + name                   = "rsi-bast"
      + resource_group_name    = "rsi-bastion-dev-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tags                   = {
          + "Component"   = "Access"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "bastion_ip_config"
          + public_ip_address_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-bastion-dev-rg/providers/Microsoft.Network/publicIPAddresses/rsi-bastion-pip"
          + subnet_id            = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/AzureBastionSubnet"
        }
    }

  # module.bastion.azurerm_subnet_network_security_group_association.this will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-bastion-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-bastion-nsg"
      + subnet_id                 = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/AzureBastionSubnet"
    }

  # module.fe-loadbalancer.azurerm_lb.azlb will be created
  + resource "azurerm_lb" "azlb" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "fe-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rsi-dev-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "myPublicIP"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.0.1.10"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public"
        }
    }

  # module.fe-loadbalancer.azurerm_lb_backend_address_pool.azlb will be created
  + resource "azurerm_lb_backend_address_pool" "azlb" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "BackEndAddressPool"
      + outbound_rules            = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb_probe.azlb[0] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[0] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[1] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "https"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + fe-subnets = [
      + "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/AzureBastionSubnet",
      + "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/frontend",
      + "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public",
    ]

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*